app/controllers/products_controller.rb

  def show
    @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @product = Product.create(
      name: params[:name],
      price: params[:price],
      image: params[:image],
      description: params[:description]
     )
---
INSERT INTO "products" ("name", "price", "image", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "yes"], ["price", "50.0"], ["image", "no"], ["description", "yes"], ["created_at", "2016-07-21 19:01:51.097600"], ["updated_at", "2016-07-21 19:01:51.097600"]]

  def edit
    @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]

   def update
      @product = Product.find_by(id: params[:id])
      @product.update(
        name: params[:name],
        price: params[:price],
        image: params[:image],
        description: params[:description]
       )
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "products" SET "image" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["image", "http://maroonersrock.com/wp-content/uploads/2016/03/PlayStation4_1864x1048.jpg"], ["updated_at", "2016-07-25 15:47:38.784910"], ["id", 1]]

   def destroy
     @product = Product.find_by(id: params[:id])
     @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 4]]